dibo1968/pfc_1phases_dspic33ak/project/pfc/pfc.c
    /** Rectify the input AC voltage. */
    pfcData->rectifiedVac = PFC_SignalRectification(pVoltage);

    /** RMS-square of the rectified input voltage. */
    PFC_SquaredRMSCalculate(&pfcData->vacRMS, pfcData->rectifiedVac);
}
/**
 * <B> Function: PFC_UpdateCurrentFeedback(PFC_T *pfcData) </B>
 * @brief Connect the inductor-current feedback to the control loop, with the
 *        measured offset removed when offset correction is enabled.
 */
inline static void PFC_UpdateCurrentFeedback(PFC_T *pfcData)
{
    /* Always connect the current feedback to the control loop. */
    pfcData->iL = pfcData->pfcCurrent.iL;
#ifdef ENABLE_PFC_CURRENT_OFFSET_CORRECTION
    /* Offset correction is an optional adjustment on top of it. */
    pfcData->iL -= pfcData->pfcCurrent.offset;
#endif
}
/**
 * <B> Function: PFC_SoftStartUpdate(PFC_T *pfcData) </B>
 * @brief Ramp the voltage-loop reference up to nominal at the soft-start rate.
 */
inline static void PFC_SoftStartUpdate(PFC_T *pfcData)
{
    if (pfcData->piVoltage.reference < PFC_OUPUT_VOLTAGE_REFERENCE)
    {
        if(pfcData->rampRate == 0)
        {
            pfcData->piVoltage.reference += RAMP_COUNT;
            pfcData->rampRate = RAMP_RATE;
        }
        else
        {
            pfcData->rampRate--;
        }
    }
    else
    {
        pfcData->piVoltage.reference = PFC_OUPUT_VOLTAGE_REFERENCE;
    }
}
/**
 * <B> Function: PFC_UpdateBoostDutyRatio(PFC_T *pfcData) </B>
 * @brief Compute the ideal boost duty ratio ((Vdc-Vac)/Vdc) from present Vdc,Vac.
 */
inline static void PFC_UpdateBoostDutyRatio(PFC_T *pfcData)
{
    PFC_MEASURE_VOLTAGE_T *pVoltage = &pfcData->pfcVoltage;

    if(pVoltage->vdc > 0)
    {
        /** Boost Duty Ratio = (1 - (Vac/Vdc)) = ((Vdc-Vac)/Vdc) */
        pfcData->boostDutyRatio =
                ((pVoltage->vdc - pfcData->rectifiedVac) / pVoltage->vdc);
    }
}
/**
 * <B> Function: PFC_BurstModeUpdate(PFC_T *pfcData) </B>
 * @brief Burst control at very low load: hold the switch off and freeze the
 *        current integrator below the minimum-power threshold.
 */
inline static void PFC_BurstModeUpdate(PFC_T *pfcData)
{
    if(pfcData->piVoltage.output < PFC_MIN_POWER)
    {
        pfcData->duty = 0;
        pfcData->piCurrent.integralOut = 0;
    }
}
/**
 * <B> Function: PFC_StateInit(PFC_T *pfcData) </B>
 * @brief PFC_INIT: reset control state, disable PWM, open the inrush relay and
 *        start current-offset measurement. Returns the next state.
 */
static PFC_CTRL_STATE_T PFC_StateInit(PFC_T *pfcData)
{
    PFC_ResetParams(pfcData);
    HAL_PFCPWMDisableOutputs();
    PFC_INRUSH_RELAY = 0;
    PFC_MeasureCurrentInit(&pfcData->pfcCurrent);

    return PFC_PRECHARGE;
}
/**
 * <B> Function: PFC_StatePrecharge(PFC_T *pfcData) </B>
 * @brief PFC_PRECHARGE: wait for the DC bulk capacitor to charge passively
 *        through the diode bridge and the inrush resistor, then bypass the
 *        inrush resistor with the relay. Returns the next state.
 */
static PFC_CTRL_STATE_T PFC_StatePrecharge(PFC_T *pfcData)
{
    /** vdcAVG.output is the moving average of the measured bus voltage in V. */
    if(pfcData->vdcAVG.output >= PFC_PRECHARGE_THRESHOLD)
    {
        PFC_INRUSH_RELAY = 1;
        return PFC_OFFSET_MEAS;
    }
    return PFC_PRECHARGE;
}
/**
 * <B> Function: PFC_StateOffsetMeas(PFC_T *pfcData) </B>
 * @brief PFC_OFFSET_MEAS: accumulate the current-offset average; once the
 *        offset and the AC average are ready, seed the voltage reference and
 *        advance. Returns the next state.
 */
static PFC_CTRL_STATE_T PFC_StateOffsetMeas(PFC_T *pfcData)
{
    PFC_MEASURE_CURRENT_T *pCurrent = &pfcData->pfcCurrent;

    PFC_MeasureCurrentOffset(pCurrent);

    if((pCurrent->status == 1) && (pfcData->vacAVG.status == 1))
    {
        /** On first completion, set the output-voltage reference to the
            measured DC voltage and enable soft start. */
        pfcData->piVoltage.reference = pfcData->vdcAVG.output;
        pfcData->pfcVoltage.offsetVac = pfcData->vacAVG.output;
        return PFC_WAIT_1CYCLE;
    }
    return PFC_OFFSET_MEAS;
}
/**
 * <B> Function: PFC_StateWait1Cycle(PFC_T *pfcData) </B>
 * @brief PFC_WAIT_1CYCLE: wait for the first RMS window to complete, then
 *        enable PWM and start closed-loop control. Returns the next state.
 */
static PFC_CTRL_STATE_T PFC_StateWait1Cycle(PFC_T *pfcData)
{
    if(pfcData->vacRMS.status == 1)
    {
        HAL_PFCPWMEnableOutputs();
        return PFC_CTRL_RUN;
    }
    return PFC_WAIT_1CYCLE;
}
/**
 * <B> Function: PFC_StateCtrlRun(PFC_T *pfcData) </B>
 * @brief PFC_CTRL_RUN: the closed-loop control sequence - current feedback,
 *        fault check, soft-start, current-reference generation, boost-duty
 *        estimate, current loop and burst control. Returns the next state.
 */
static PFC_CTRL_STATE_T PFC_StateCtrlRun(PFC_T *pfcData)
{
    PFC_UpdateCurrentFeedback(pfcData);

    PFC_FaultCheck(pfcData);
    if(pfcData->faultStatus != PFC_FAULT_NONE)
    {
        return PFC_FAULT;
    }

    PFC_SoftStartUpdate(pfcData);
    PFC_CurrentRefGenerate(pfcData);
    PFC_UpdateBoostDutyRatio(pfcData);
    PFC_CurrentControlLoop(pfcData);
    PFC_BurstModeUpdate(pfcData);

    return PFC_CTRL_RUN;
}
/**
 * <B> Function: PFC_StateFault(PFC_T *pfcData) </B>
 * @brief PFC_FAULT: hold PWM off and duty at zero; clear each auto-recovering
 *        fault against its hysteresis limit (IP_OC stays latched). When all
 *        faults clear, re-engage and return to PFC_CTRL_RUN. Returns the next
 *        state.
 */
static PFC_CTRL_STATE_T PFC_StateFault(PFC_T *pfcData)
{
    pfcData->duty = 0;
    HAL_PFCPWMDisableOutputs();

    /** Clear input under-voltage once the input recovers above the UV upper
        (recovery) limit - hysteresis vs the UV trip limit. */
    if(pfcData->vacRMS.sqrOutput >= PFC_INPUT_UNDER_VOLTAGE_LIMIT_HI)
    {
        pfcData->faultStatus &= (~PFC_FAULT_IP_UV);
    }
    /** Clear input over-voltage once the input falls below the OV lower
        (recovery) limit - hysteresis vs the OV trip limit. */
    if(pfcData->vacRMS.sqrOutput < PFC_INPUT_OVER_VOLTAGE_LIMIT_LO)
    {
        pfcData->faultStatus &= (~PFC_FAULT_IP_OV);
    }
    /** Clear output over-voltage only once the bus has bled down below the OV
        recovery limit (hysteresis vs the trip limit). */
    if(pfcData->vdcAVG.output < PFC_OUTPUT_OVER_VOLTAGE_RECOVERY_LIMIT)
    {
        pfcData->faultStatus &= (~PFC_FAULT_OP_OV);
    }
    /** Clear output under-voltage once the bus has climbed back above the UV
        recovery limit. With PWM disabled the bus is passively capped at the
        rectified input peak, so this auto-recovers at nominal/high line; at low
        line it holds off until the bus rises - a slow hiccup, since OP_UV
        re-arms only after soft-start reaches nominal again. */
    if(pfcData->vdcAVG.output >= PFC_OUTPUT_UNDER_VOLTAGE_RECOVERY_LIMIT)
    {
        pfcData->faultStatus &= (~PFC_FAULT_OP_UV);
    }
    /** PFC_FAULT_IP_OC is latching: deliberately never cleared here, so an
        over-current event holds the converter off until a reset
        (PFC_ServiceInit). */
    if(pfcData->faultStatus == PFC_FAULT_NONE)
    {
        pfcData->piVoltage.integralOut = 0;
        pfcData->piCurrent.integralOut = 0;
        pfcData->piVoltage.reference = pfcData->vdcAVG.output;
        HAL_PFCPWMEnableOutputs();
        return PFC_CTRL_RUN;
    }
    return PFC_FAULT;
}
/**
* <B> Function: PFC_ServiceInit()     </B>
* 
* @brief Function calls the PFC_ParamsInit() which initializes the control 
*       parameters.      
* @param none.
* @return none.
* @example
* <CODE> PFC_ServiceInit();        </CODE>
*
*/

void PFC_ServiceInit(void)
{
    /* Make sure ADC does not generate interrupt while initializing parameters*/
	DisablePFCADCInterrupt();
    
    PFC_ParamsInit(&pfcParam);
    
    /* Enable ADC interrupt and begin main loop timing */
    ClearPFCADCIF();
    ClearPFCADCIF_ReadADCBUF();
    EnablePFCADCInterrupt(); 
}
/**
 * <B> Function: PFC_ParamsInit(PFC_T *pfcData)  </B>
 * 
 * @brief Function to initialize PFC related variables 
 * @param Pointer to the data structure containing PFC related variables.
 * PI coefficients, scaling constants etc
 * @return none.
 * @example
 * <code>
 * PFC_ParamsInit(PFC_T *pfcData)
 * </code>
 */
void PFC_ParamsInit(PFC_T *pfcData)
{  
    /** Initialize variables related to RMS calculation - VAC */      
    pfcData->vacRMS.sampleLimit = PFC_RMS_SQUARE_COUNTMAX;
    /** Initialize variables related to Average calculation - VDC */ 
    pfcData->vdcAVG.sampleLimit = PFC_VDC_AVG_SAMPLES;
    
