dibo1968/pfc_1phases_dspic33ak/project/pfc/pfc.c
    pfcData->vacAVG.sampleLimit = PFC_INPUT_FREQUENCY_COUNTER;

/** Initialize PI controlling PFC Current Loop */    
    pfcData->piCurrent.kp = KP_I;
    pfcData->piCurrent.ki = KI_I;
//    pfcData->piCurrent.kpScale = KP_I_SCALE;
//    pfcData->piCurrent.kiScale = KI_I_SCALE;
    pfcData->piCurrent.maxOutput = PFC_MAX_DUTY;
    pfcData->piCurrent.minOutput = 0;
    
/** Initialize PI controlling PFC Voltage Loop */    
    pfcData->piVoltage.kp = KP_V;
    pfcData->piVoltage.ki = KI_V;
    pfcData->piVoltage.maxOutput = PI_V_OUT_MAX;
    pfcData->piVoltage.minOutput = 0;
    
    pfcData->state = PFC_INIT;
    pfcData->faultStatus = PFC_FAULT_NONE;
    /* Average-current reconstruction method, see PFC_DCM_COMP_T. Writable at
     * run time so the methods can be A/B'd on a single build. */
    pfcData->sampleCorrectionEnable = PFC_DCM_COMPENSATION_METHOD;
    pfcData->dcmDetected = 0;
    pfcData->iValleyEst = 0.0f;
    pfcData->sampleCorrFactor = 1.0f;

/** Initialize load-current feed-forward (disabled by default). */
    pfcData->loadFF.scale       = PFC_LOAD_CURRENT_SCALE;
    pfcData->loadFF.filtCoeff   = PFC_LOAD_FF_FILT_COEFF;
    pfcData->loadFF.gain        = PFC_LOAD_FF_GAIN;
    pfcData->loadFF.enable      = PFC_LOAD_FF_ENABLE_DEFAULT;
    pfcData->loadFF.currentFilt = 0;
}
/**
 * <B> Function: PFC_ResetParams(PFC_T *pData)  </B>
 * 
 * @brief Function to reset the variables related to moving average filter of 
 * Vdc,variables related to moving average filter of Vac,variables related to 
 * PI integrator and the duty cycle.
 * @param Pointer to the data structure containing PFC related variables
 * @return none
 * @example
 * <code>
 * PFC_ResetParams(PFC_T *pData);
 * </code>
 */
void PFC_ResetParams(PFC_T *pData)
{   
    /** Initialize variables related to moving average filter - Vdc */    
    pData->vdcAVG.sum = 0;
    pData->vdcAVG.samples = 0;
    pData->vdcAVG.status = 0;

    /** Initialize variables related to moving average filter - Vac */
    pData->vacAVG.sum = 0;
    pData->vacAVG.samples = 0;
    pData->vacRMS.sum = 0;
    pData->vacRMS.samples = 0;
    pData->vacRMS.peak = 0;
    pData->vacRMS.status = 0;

    /** Initialize variables related to PI integrator */
    pData->piVoltage.integralOut = 0;
    pData->piCurrent.integralOut = 0;

    /** Initialize the duty cycle */
    pData->duty = 0;
}

/**
 * <B> Function: PFC_DcmAverageFactor(PFC_T *pData)  </B>
 *
 * @brief Ratio between the true cycle-average inductor current and the mid-ON
 * sample, i.e. the conduction fraction (d1+d2).
 * @param Pointer to the data structure containing PFC related variables
 * @return correction factor in (0,1]
 * @example
 * <code>
 * factor = PFC_DcmAverageFactor(pData);
 * </code>
 */
static float PFC_DcmAverageFactor(PFC_T *pData)
{
    /* IL is sampled at mid-ON:
     *   CCM: the sample already equals the average IL           -> factor 1.
     *   DCM: the sample is ~Ipk/2, but the cycle-average is LOWER because the
     *        current idles at zero for part of the period:
     *          I_avg = (Ipk/2)*(d1+d2) = sample * (d1 / D_ideal),
     *        with d1 = ON duty (piCurrent.output),
     *        D_ideal = (Vout-Vin)/Vout = boostDutyRatio, and
     *        (d1+d2) = d1/D_ideal < 1 in DCM.
     * Note d2 = d1*Vg/(Vo-Vg) assumes an ideal converter: the diode drop, DCR
     * and Rds_on all stretch the real demagnetising time slightly. */
    float factor = 1.0f;

    if (pData->boostDutyRatio > 0.0f)
    {
        factor = pData->piCurrent.output / pData->boostDutyRatio;

        /* Losses/transients can push d1 past D_ideal; that must never inflate
         * the reading, so cap at unity. Under PFC_DCM_COMP_RATIO this cap is
         * also what decides CCM, which is precisely the weakness that
         * PFC_DCM_COMP_VALLEY_EST removes. */
        if (factor > 1.0f)
        {
            factor = 1.0f;
        }
        else if (factor < 0.0f)
        {
            factor = 0.0f;
        }
    }
    return factor;
}
/**
 * <B> Function: PFC_ConductionModeDetect(PFC_T *pData)  </B>
 *
 * @brief Detects CCM/DCM by predicting the inductor current at the end of the
 * OFF time and testing it against zero. Also publishes the estimate itself in
 * pData->iValleyEst for logging.
 * @param Pointer to the data structure containing PFC related variables
 * @return 1 if DCM, 0 if CCM
 * @example
 * <code>
 * pData->dcmDetected = PFC_ConductionModeDetect(pData);
 * </code>
 */
static uint16_t PFC_ConductionModeDetect(PFC_T *pData)
{
    const float d  = pData->piCurrent.output;   /* duty that produced this sample */
    const float vg = pData->rectifiedVac;
    const float vo = pData->pfcVoltage.vdc;

    /* Walk the CCM current path forward from the mid-ON sample:
     *    rise over the remaining half of the ON time : +(vg/L)*(d*Ts/2)
     *    fall over the whole OFF time                : +((vg-vo)/L)*(1-d)*Ts
     * Collecting terms,
     *    iValleyEst = i + (Ts/L)*( vg*(1 - d/2) - vo*(1 - d) )
     *
     * In CCM the current really does follow that path, so the estimate is the
     * actual valley and is >= 0. In DCM the current hits zero before the OFF
     * time is up and then sits there, so the continued-slope estimate
     * undershoots into negative territory.
     *
     * The point of doing it this way is the threshold: it is a FIXED zero, not
     * a sampled quantity. Comparing an estimate against a sample (which is what
     * the min(d1/D_ideal,1) clamp effectively does) makes the decision jitter
     * on sample noise right at the boundary, and every toggle is a duty
     * discontinuity that shows up as input current distortion. */
    pData->iValleyEst = pData->iL
                      + (PFC_TS_OVER_L * ((vg * (1.0f - (0.5f * d)))
                                        - (vo * (1.0f - d))));

    return (pData->iValleyEst < 0.0f) ? 1u : 0u;
}
/**
 * <B> Function: PFC_CurrentSampleCorrection(PFC_T *pData)  </B>
 *
 * @brief Function to calculate average value of current in discontinuous
 * conduction mode. Writes averageCurrent, dcmDetected, iValleyEst and
 * sampleCorrFactor.
 * @param Pointer to the data structure containing PFC related variables
 * @return none
 * @example
 * <code>
 * PFC_CurrentSampleCorrection(PFC_T *pData);
 * </code>
 */
static void PFC_CurrentSampleCorrection(PFC_T *pData)
{
    /* Always evaluated, whichever method is driving the loop, so that one run
     * shows what valley estimation would have decided even when it is not the
     * active method. Costs a handful of flops. */
    const uint16_t dcmByValley = PFC_ConductionModeDetect(pData);

