dibo1968/pfc_1phases_dspic33ak/project/pfc/pfc.c
    switch (pData->sampleCorrectionEnable)
    {
        case PFC_DCM_COMP_RATIO:
            /* Legacy: the unity cap is the mode decision. Report DCM whenever
             * the cap did not bind, so dcmDetected is directly comparable
             * against the valley method's answer. */
            pData->sampleCorrFactor = PFC_DcmAverageFactor(pData);
            pData->dcmDetected = (pData->sampleCorrFactor < 1.0f) ? 1u : 0u;
            break;

        case PFC_DCM_COMP_VALLEY_EST:
            /* Detect first, then correct only if DCM was actually detected. */
            pData->dcmDetected = dcmByValley;
            pData->sampleCorrFactor = (dcmByValley != 0u)
                                    ? PFC_DcmAverageFactor(pData)
                                    : 1.0f;
            break;

        case PFC_DCM_COMP_OFF:
        default:
            pData->dcmDetected = 0u;
            pData->sampleCorrFactor = 1.0f;
            break;
    }

    pData->averageCurrent = pData->iL * pData->sampleCorrFactor;
}
/**
 * <B> Function: PFC_CurrentControlLoop(PFC_T *pData)  </B>
 * 
 * @brief Function to execute current control loop of PFC
 * @param Pointer to the data structure containing PFC related variables
 * @return none
 * @example
 * <code>
 * PFC_CurrentControlLoop(PFC_T *pData);
 * </code>
 */
inline static void PFC_CurrentControlLoop(PFC_T *pData)
{
    float duty;
    
    /** Ensure PFC current  is not negative.*/ 
    if (pData->iL < 0)
    {
        pData->iL  = PFC_IL_MIN;
    }
    /** Calculate average current if converter operates in discontinuous
        conduction mode. In continuous conduction mode, measured current is
        used as is ,as average current is obtained. The method is selected by
        pData->sampleCorrectionEnable (PFC_DCM_COMP_T). */
    PFC_CurrentSampleCorrection(pData);

    /* Populate the reference/input fields for logging. The PI update only
     * consumes .error, so these are purely for a self-describing bus. */
    pData->piCurrent.reference = pData->currentReference;
    pData->piCurrent.input     = pData->averageCurrent;
    pData->piCurrent.error = (pData->currentReference - pData->averageCurrent);

    PFC_ControllerPIUpdate(&pData->piCurrent);
    
    /** Calculate duty cycle of PWM that controls PFC in terms of PWM Period */
    duty  = (pData->piCurrent.output * PFC_LOOPTIME_TCY);
    if (duty  > PFC_MAX_DUTY_COUNTS)
    {
        pData->duty = PFC_MAX_DUTY_COUNTS;
        pData->piCurrent.integralOut = PI_I_OUT_MAX;       
    }
    else if (duty  < PFC_MIN_DUTY_COUNTS)
    {
        pData->duty = PFC_MIN_DUTY_COUNTS;
    }
    else
    {
        pData->duty = duty;
    }
}
/**
 * <B> Function: PFC_CurrentRefGenerate(PFC_T *pData)  </B>
 * 
 * @brief Function to calculate current reference for the current control loop
 * @param Pointer to the data structure containing PFC related variables
 * @return none
 * @example
 * <code>
 * PFC_CurrentRefGenerate(PFC_T *pData);
 * </code>
 */
inline static void PFC_CurrentRefGenerate(PFC_T *pData)
{ 
    /** PI Execution - PFC output voltage control.
        Voltage PI is called at the rate specified by VOLTAGE_LOOP_EXE_RATE */
    if (++pData->voltLoopExeRate >= VOLTAGE_LOOP_EXE_RATE)
    {
        pData->piVoltage.error = pData->piVoltage.reference-pData->vdcAVG.output;

        /* Gain-schedule the integral term with hysteresis: halve Ki for large
           errors, restore full Ki for small errors, and hold the current Ki
           inside the [LO, HI] band so it cannot dither at the switch point.
           piVoltage.ki persists across ticks, so no extra state is needed. */
        if((pData->piVoltage.error > PFC_VOLTAGE_ERR_GAIN_HI) ||
           (pData->piVoltage.error < -PFC_VOLTAGE_ERR_GAIN_HI))
        {
            pData->piVoltage.ki = KI_V / 2;
        }
        else if((pData->piVoltage.error < PFC_VOLTAGE_ERR_GAIN_LO) &&
                (pData->piVoltage.error > -PFC_VOLTAGE_ERR_GAIN_LO))
        {
            pData->piVoltage.ki = KI_V;
        }
        /* else: within the hysteresis band - hold the previous Ki. */
        /* Record the measurement for a self-describing bus; the reference is
         * already set by the soft-start ramp. */
        pData->piVoltage.input = pData->vdcAVG.output;
        PFC_ControllerPIUpdate(&pData->piVoltage);
        pData->voltLoopExeRate = 0;
    }
    
    /** Current reference = powerCommand * rectifiedVac * KMUL / VacRMS^2.
        powerCommand is the voltage-loop output plus, when enabled, the load-
        power feed-forward (loadFF.powerFF). The feed-forward supplies the load
        power directly so the slow voltage loop only trims losses/errors; this
        cancels the load disturbance in the DC-bus power balance and sharply
        improves the load-step response. */
    {
        float powerCommand = pData->piVoltage.output;
        if (pData->loadFF.enable)
        {
            powerCommand += pData->loadFF.powerFF;
        }
        pData->currentReference = (float)((powerCommand * pData->rectifiedVac * KMUL)
                            / pData->vacRMS.sqrOutput);
    }
    /**  Perform Boundary check of generated current reference */
    if (pData->currentReference > PFC_IREF_PEAK_MAX)
    {
        pData->currentReference = PFC_IREF_PEAK_MAX;
    }
    else if (pData->currentReference < 0)
    {
        pData->currentReference = 0;
    }
}
/**
 * <B> Function: float PFC_SignalRectification(PFC_MEASURE_VOLTAGE_T *pSignal)  </B>
 * 
 * @brief Function to rectify the input AC voltage
 * @param Pointer to the data structure containing measured voltage
 * @return Rectified signal
 * @example
 * <code>
 * PFC_SignalRectification();
 * </code>
 */
float PFC_SignalRectification(PFC_MEASURE_VOLTAGE_T *pSignal)
{   
    float output = pSignal->vac - pSignal->offsetVac;
    
    if(output < 0)
    {
        output = -(output);
    }  
    return(output);
}
/**
 * <B> Function: PFC_SquaredRMSCalculate(PFC_RMS_SQUARE_T *pData,float input)  </B>
 * 
 * @brief Function to calculate RMS value of an input signal
 * @param Pointer to the data structure containing variables related to RMS 
 * calculation, current value of signal  
 * @return none.
 * @example
 * <code>
 * PFC_SquaredRMSCalculate(PFC_RMS_SQUARE_T *pData,float input);
 * </code>
 */
static void PFC_SquaredRMSCalculate(PFC_RMS_SQUARE_T *pData,float input)
{       
        pData->sum += (float) (input*input);
    pData->samples++;
    /** Match PFC_Average's ordering: accumulate, increment, then test with >=
        so each window integrates exactly sampleLimit terms and divides by the
        same count. (Previously the sum held sampleLimit+1 terms but divided by
        sampleLimit, biasing sqrOutput high by 1/sampleLimit and stretching the
        window one sample past the half-line cycle.) */
    if(pData->samples >= pData->sampleLimit)
    {
       pData->sqrOutput = (float)((pData->sum/pData->sampleLimit));
       pData->status    = 1;
       pData->samples   = 0;
       pData->sum       = 0;
    }
}
/**
 * <B> Function: PFC_Average(PFC_AVG_T *pData,float input)  </B>
 * 
 * @brief Function to calculate moving average value of an input Signal
 * @param Pointer to the data structure containing variables related to average 
 * calculation, current value of signal 
 * @return none.
 * @example
 * <code>
 * PFC_Average(PFC_AVG_T *pData,float input);
 * </code>
 */
static void PFC_Average(PFC_AVG_T *pData,float input)
{
    pData->sum = pData->sum + input;
    pData->samples++;
    if(pData->samples >= pData->sampleLimit) 
    {
        pData->output  = (float)(pData->sum/pData->sampleLimit);
        pData->status  = 1;
        pData->sum     = 0;
        pData->samples = 0; 
    }
}


/**
 * <B> Function: PFC_FaultCheck(PFC_T *pData)  </B>
 * 
 * @brief Function to check the different fault status
 * @param Pointer to the data structure containing PFC related variables
 * @return none
 * @example
 * <code>
 * PFC_FaultCheck(PFC_T *pData);
 * </code>
 */
void PFC_FaultCheck(PFC_T *pData)
{
    /** Recompute the fault mask from scratch each pass so faults never
        accumulate or alias; each fault is an independent bit set with |=.
        Latching / recovery is handled by the PFC_FAULT state, not here. */
    uint16_t faults = PFC_FAULT_NONE;

    /*Check the condition for output over voltage*/
    if(pData->vdcAVG.output >= PFC_OUTPUT_OVER_VOLTAGE_LIMIT)
    {
        faults |= PFC_FAULT_OP_OV;
    }
    /*Check the condition for input under voltage*/
    if(pData->vacRMS.sqrOutput < PFC_INPUT_UNDER_VOLTAGE_LIMIT_LO)
    {
        faults |= PFC_FAULT_IP_UV;
    }
    /*Check the condition for input over voltage*/
    if(pData->vacRMS.sqrOutput >= PFC_INPUT_OVER_VOLTAGE_LIMIT_HI)
    {
        faults |= PFC_FAULT_IP_OV;
    }
    /** Instantaneous input over-current - software OCP on the offset-corrected
        inductor current (symmetric test catches either polarity). Latching:
        PFC_FAULT provides no auto-clear, because once PWM is disabled the
        inductor current decays to zero in microseconds and a threshold-based
        clear would self-clear immediately. */
    if((pData->iL >=  PFC_INPUT_OVER_CURRENT_PEAK) ||
       (pData->iL <= -PFC_INPUT_OVER_CURRENT_PEAK))
    {
        faults |= PFC_FAULT_IP_OC;
    }
    /** Output under-voltage (bus collapse / boost failure / overload), armed
        only once soft-start has reached the nominal reference - during the
        ramp the bus is legitimately below nominal. Auto-recovering with
        hysteresis (see the UV recovery clear in PFC_FAULT). */
    if((pData->piVoltage.reference >= PFC_OUPUT_VOLTAGE_REFERENCE) &&
       (pData->vdcAVG.output < PFC_OUTPUT_UNDER_VOLTAGE_LIMIT))
    {
        faults |= PFC_FAULT_OP_UV;
    }

    pData->faultStatus = faults;
}
// </editor-fold>